[Survived] BlockStatement
services/utils/scoringUtils.js:11:25
  * @param {string} text
  * @returns {string[]}
  */
-function tokenize(text) {
-  if (!text || typeof text !== 'string') return [];
-  return text.toLowerCase().match(/\b\w+\b/g) || [];
-}
+function tokenize(text) {}
 
 /**

[Survived] BooleanLiteral
services/utils/scoringUtils.js:12:7
  * @returns {string[]}
  */
 function tokenize(text) {
-  if (!text || typeof text !== 'string') return [];
+  if (text || typeof text !== 'string') return [];
   return text.toLowerCase().match(/\b\w+\b/g) || [];
 }

[Survived] LogicalOperator
services/utils/scoringUtils.js:12:7
  * @returns {string[]}
  */
 function tokenize(text) {
-  if (!text || typeof text !== 'string') return [];
+  if (!text && typeof text !== 'string') return [];
   return text.toLowerCase().match(/\b\w+\b/g) || [];
 }

[Survived] ConditionalExpression
services/utils/scoringUtils.js:13:10
  */
 function tokenize(text) {
   if (!text || typeof text !== 'string') return [];
-  return text.toLowerCase().match(/\b\w+\b/g) || [];
+  return true;
 }
 

[Survived] MethodExpression
services/utils/scoringUtils.js:13:10
  */
 function tokenize(text) {
   if (!text || typeof text !== 'string') return [];
-  return text.toLowerCase().match(/\b\w+\b/g) || [];
+  return text.toUpperCase().match(/\b\w+\b/g) || [];
 }
 

[Survived] BlockStatement
services/utils/scoringUtils.js:21:35
  * @param {string[]} tokens
  * @returns {Object} - map of token -> frequency
  */
-function getTermFrequency(tokens) {
-  const freq = {};
-  for (const token of tokens) {
-    freq[token] = (freq[token] || 0) + 1;
-  }
-  return freq;
-}
+function getTermFrequency(tokens) {}
 
 /**

[Survived] BlockStatement
services/utils/scoringUtils.js:23:31
  */
 function getTermFrequency(tokens) {
   const freq = {};
-  for (const token of tokens) {
-    freq[token] = (freq[token] || 0) + 1;
-  }
+  for (const token of tokens) {}
   return freq;
 }

[Survived] LogicalOperator
services/utils/scoringUtils.js:24:20
 function getTermFrequency(tokens) {
   const freq = {};
   for (const token of tokens) {
-    freq[token] = (freq[token] || 0) + 1;
+    freq[token] = (freq[token] && 0) + 1;
   }
   return freq;

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:24:19
 function getTermFrequency(tokens) {
   const freq = {};
   for (const token of tokens) {
-    freq[token] = (freq[token] || 0) + 1;
+    freq[token] = (freq[token] || 0) - 1;
   }
   return freq;

[Killed] BlockStatement
services/utils/scoringUtils.js:37:81
  * @param {number} phoneScore - phone match score in [0, 1]
  * @returns {number} weighted confidence score in [0, 1]
  */
-export function calculateConfidenceScore(sourceScore, addressScore, phoneScore) {
-  const inputs = [
-    ['sourceScore', sourceScore],
-    ['addressScore', addressScore],
-    ['phoneScore', phoneScore]
-  ];
-
-  for (const [name, value] of inputs) {
-    if (typeof value !== 'number' || !Number.isFinite(value)) {
-      throw new TypeError(`${name} must be a finite number`);
-    }
-    if (value < 0 || value > 1) {
-      throw new RangeError(`${name} must be between 0 and 1`);
-    }
-  }
-
-  return 0.5 * sourceScore + 0.3 * addressScore + 0.2 * phoneScore;
-}
+export function calculateConfidenceScore(sourceScore, addressScore, phoneScore) {}
 
 /**
killedBy: calculateConfidenceScore calculates weighted confidence score correctly for typical inputs
statusReason: TypeError: expect(received).toBeCloseTo(expected, precision)

Matcher error: received value must be a number

Received has value: undefined

[Killed] ArrayDeclaration
services/utils/scoringUtils.js:41:5
   const inputs = [
     ['sourceScore', sourceScore],
     ['addressScore', addressScore],
-    ['phoneScore', phoneScore]
+    []
   ];
 
killedBy: calculateConfidenceScore calculates weighted confidence score correctly for typical inputs
statusReason: TypeError: undefined must be a finite number

[Killed] BlockStatement
services/utils/scoringUtils.js:44:39
     ['phoneScore', phoneScore]
   ];
 
-  for (const [name, value] of inputs) {
-    if (typeof value !== 'number' || !Number.isFinite(value)) {
-      throw new TypeError(`${name} must be a finite number`);
-    }
-    if (value < 0 || value > 1) {
-      throw new RangeError(`${name} must be between 0 and 1`);
-    }
-  }
+  for (const [name, value] of inputs) {}
 
   return 0.5 * sourceScore + 0.3 * addressScore + 0.2 * phoneScore;
killedBy: calculateConfidenceScore throws TypeError for non-number inputs
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: TypeError

Received function did not throw

[Killed] LogicalOperator
services/utils/scoringUtils.js:45:9
   ];
 
   for (const [name, value] of inputs) {
-    if (typeof value !== 'number' || !Number.isFinite(value)) {
+    if (typeof value !== 'number' && !Number.isFinite(value)) {
       throw new TypeError(`${name} must be a finite number`);
     }
killedBy: calculateConfidenceScore throws TypeError for NaN and Infinity
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: TypeError

Received function did not throw

[Killed] ConditionalExpression
services/utils/scoringUtils.js:45:9
   ];
 
   for (const [name, value] of inputs) {
-    if (typeof value !== 'number' || !Number.isFinite(value)) {
+    if (false) {
       throw new TypeError(`${name} must be a finite number`);
     }
killedBy: calculateConfidenceScore throws TypeError for non-number inputs
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: TypeError

Received function did not throw

[Survived] StringLiteral
services/utils/scoringUtils.js:46:27
 
   for (const [name, value] of inputs) {
     if (typeof value !== 'number' || !Number.isFinite(value)) {
-      throw new TypeError(`${name} must be a finite number`);
+      throw new TypeError(``);
     }
     if (value < 0 || value > 1) {

[Killed] EqualityOperator
services/utils/scoringUtils.js:48:22
     if (typeof value !== 'number' || !Number.isFinite(value)) {
       throw new TypeError(`${name} must be a finite number`);
     }
-    if (value < 0 || value > 1) {
+    if (value < 0 || value >= 1) {
       throw new RangeError(`${name} must be between 0 and 1`);
     }
killedBy: calculateConfidenceScore uses exact component weights when only one signal is present
statusReason: RangeError: sourceScore must be between 0 and 1

[Killed] ConditionalExpression
services/utils/scoringUtils.js:48:9
     if (typeof value !== 'number' || !Number.isFinite(value)) {
       throw new TypeError(`${name} must be a finite number`);
     }
-    if (value < 0 || value > 1) {
+    if (false) {
       throw new RangeError(`${name} must be between 0 and 1`);
     }
killedBy: calculateConfidenceScore throws RangeError for out-of-range numeric inputs
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: RangeError

Received function did not throw

[Killed] ArithmeticOperator
services/utils/scoringUtils.js:53:10
     }
   }
 
-  return 0.5 * sourceScore + 0.3 * addressScore + 0.2 * phoneScore;
+  return 0.5 * sourceScore + 0.3 * addressScore - 0.2 * phoneScore;
 }
 
killedBy: calculateConfidenceScore calculates weighted confidence score correctly for typical inputs
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 0.66
Received: 0.5

Expected precision:    10
Expected difference: < 0.00000000005
Received difference:   0.16000000000000003

[Killed] ArithmeticOperator
services/utils/scoringUtils.js:53:51
     }
   }
 
-  return 0.5 * sourceScore + 0.3 * addressScore + 0.2 * phoneScore;
+  return 0.5 * sourceScore + 0.3 * addressScore + 0.2 / phoneScore;
 }
 
killedBy: calculateConfidenceScore calculates weighted confidence score correctly for typical inputs
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 0.66
Received: 1.08

Expected precision:    10
Expected difference: < 0.00000000005
Received difference:   0.42000000000000004

[Survived] BooleanLiteral
services/utils/scoringUtils.js:64:17
  * @returns {number} - similarity score 0–1
  */
 export function cosineSimilarity(textA, textB) {
-  if (!textA || !textB) return 0;
+  if (!textA || textB) return 0;
 
   const tokensA = tokenize(textA);

[Survived] LogicalOperator
services/utils/scoringUtils.js:64:7
  * @returns {number} - similarity score 0–1
  */
 export function cosineSimilarity(textA, textB) {
-  if (!textA || !textB) return 0;
+  if (!textA && !textB) return 0;
 
   const tokensA = tokenize(textA);

[Survived] ConditionalExpression
services/utils/scoringUtils.js:69:31
   const tokensA = tokenize(textA);
   const tokensB = tokenize(textB);
 
-  if (tokensA.length === 0 || tokensB.length === 0) return 0;
+  if (tokensA.length === 0 || false) return 0;
 
   const freqA = getTermFrequency(tokensA);

[Survived] ConditionalExpression
services/utils/scoringUtils.js:69:7
   const tokensA = tokenize(textA);
   const tokensB = tokenize(textB);
 
-  if (tokensA.length === 0 || tokensB.length === 0) return 0;
+  if (true) return 0;
 
   const freqA = getTermFrequency(tokensA);

[Survived] BlockStatement
services/utils/scoringUtils.js:81:34
   let magnitudeA = 0;
   let magnitudeB = 0;
 
-  for (const token of allTokens) {
-    const valA = freqA[token] || 0;
-    const valB = freqB[token] || 0;
-
-    dotProduct += valA * valB;
-    magnitudeA += valA * valA;
-    magnitudeB += valB * valB;
-  }
+  for (const token of allTokens) {}
 
   magnitudeA = Math.sqrt(magnitudeA);

[Survived] LogicalOperator
services/utils/scoringUtils.js:82:18
   let magnitudeB = 0;
 
   for (const token of allTokens) {
-    const valA = freqA[token] || 0;
+    const valA = freqA[token] && 0;
     const valB = freqB[token] || 0;
 

[Survived] ConditionalExpression
services/utils/scoringUtils.js:82:18
   let magnitudeB = 0;
 
   for (const token of allTokens) {
-    const valA = freqA[token] || 0;
+    const valA = true;
     const valB = freqB[token] || 0;
 

[Survived] ConditionalExpression
services/utils/scoringUtils.js:83:18
 
   for (const token of allTokens) {
     const valA = freqA[token] || 0;
-    const valB = freqB[token] || 0;
+    const valB = false;
 
     dotProduct += valA * valB;

[Survived] ConditionalExpression
services/utils/scoringUtils.js:83:18
 
   for (const token of allTokens) {
     const valA = freqA[token] || 0;
-    const valB = freqB[token] || 0;
+    const valB = true;
 
     dotProduct += valA * valB;

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:85:19
     const valA = freqA[token] || 0;
     const valB = freqB[token] || 0;
 
-    dotProduct += valA * valB;
+    dotProduct += valA / valB;
     magnitudeA += valA * valA;
     magnitudeB += valB * valB;

[Survived] AssignmentOperator
services/utils/scoringUtils.js:85:5
     const valA = freqA[token] || 0;
     const valB = freqB[token] || 0;
 
-    dotProduct += valA * valB;
+    dotProduct -= valA * valB;
     magnitudeA += valA * valA;
     magnitudeB += valB * valB;

[Survived] AssignmentOperator
services/utils/scoringUtils.js:86:5
     const valB = freqB[token] || 0;
 
     dotProduct += valA * valB;
-    magnitudeA += valA * valA;
+    magnitudeA -= valA * valA;
     magnitudeB += valB * valB;
   }

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:86:19
     const valB = freqB[token] || 0;
 
     dotProduct += valA * valB;
-    magnitudeA += valA * valA;
+    magnitudeA += valA / valA;
     magnitudeB += valB * valB;
   }

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:87:19
 
     dotProduct += valA * valB;
     magnitudeA += valA * valA;
-    magnitudeB += valB * valB;
+    magnitudeB += valB / valB;
   }
 

[Survived] AssignmentOperator
services/utils/scoringUtils.js:87:5
 
     dotProduct += valA * valB;
     magnitudeA += valA * valA;
-    magnitudeB += valB * valB;
+    magnitudeB -= valB * valB;
   }
 

[Survived] ConditionalExpression
services/utils/scoringUtils.js:93:27
   magnitudeA = Math.sqrt(magnitudeA);
   magnitudeB = Math.sqrt(magnitudeB);
 
-  if (magnitudeA === 0 || magnitudeB === 0) return 0;
+  if (magnitudeA === 0 || false) return 0;
 
   return dotProduct / (magnitudeA * magnitudeB);

[Survived] EqualityOperator
services/utils/scoringUtils.js:93:7
   magnitudeA = Math.sqrt(magnitudeA);
   magnitudeB = Math.sqrt(magnitudeB);
 
-  if (magnitudeA === 0 || magnitudeB === 0) return 0;
+  if (magnitudeA !== 0 || magnitudeB === 0) return 0;
 
   return dotProduct / (magnitudeA * magnitudeB);

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:95:24
 
   if (magnitudeA === 0 || magnitudeB === 0) return 0;
 
-  return dotProduct / (magnitudeA * magnitudeB);
+  return dotProduct / (magnitudeA / magnitudeB);
 }
 

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:95:10
 
   if (magnitudeA === 0 || magnitudeB === 0) return 0;
 
-  return dotProduct / (magnitudeA * magnitudeB);
+  return dotProduct * (magnitudeA * magnitudeB);
 }
 

[Survived] LogicalOperator
services/utils/scoringUtils.js:106:7
  * @returns {number} - similarity score 0–1
  */
 export function jaroWinkler(a, b) {
-  if (!a || !b) return 0;
+  if (!a && !b) return 0;
 
   a = String(a).toLowerCase();

[Survived] ConditionalExpression
services/utils/scoringUtils.js:106:7
  * @returns {number} - similarity score 0–1
  */
 export function jaroWinkler(a, b) {
-  if (!a || !b) return 0;
+  if (true) return 0;
 
   a = String(a).toLowerCase();

[Survived] MethodExpression
services/utils/scoringUtils.js:108:7
 export function jaroWinkler(a, b) {
   if (!a || !b) return 0;
 
-  a = String(a).toLowerCase();
+  a = String(a).toUpperCase();
   b = String(b).toLowerCase();
 

[Survived] MethodExpression
services/utils/scoringUtils.js:109:7
   if (!a || !b) return 0;
 
   a = String(a).toLowerCase();
-  b = String(b).toLowerCase();
+  b = String(b).toUpperCase();
 
   if (a === b) return 1;

[Survived] ConditionalExpression
services/utils/scoringUtils.js:111:7
   a = String(a).toLowerCase();
   b = String(b).toLowerCase();
 
-  if (a === b) return 1;
+  if (true) return 1;
   if (a.length === 0 || b.length === 0) return 0;
 

[Survived] EqualityOperator
services/utils/scoringUtils.js:111:7
   a = String(a).toLowerCase();
   b = String(b).toLowerCase();
 
-  if (a === b) return 1;
+  if (a !== b) return 1;
   if (a.length === 0 || b.length === 0) return 0;
 

[Survived] EqualityOperator
services/utils/scoringUtils.js:112:25
   b = String(b).toLowerCase();
 
   if (a === b) return 1;
-  if (a.length === 0 || b.length === 0) return 0;
+  if (a.length === 0 || b.length !== 0) return 0;
 
   // Compute Jaro similarity first

[Survived] LogicalOperator
services/utils/scoringUtils.js:112:7
   b = String(b).toLowerCase();
 
   if (a === b) return 1;
-  if (a.length === 0 || b.length === 0) return 0;
+  if (a.length === 0 && b.length === 0) return 0;
 
   // Compute Jaro similarity first

[Survived] MethodExpression
services/utils/scoringUtils.js:117:36
   // Compute Jaro similarity first
   const len1 = a.length;
   const len2 = b.length;
-  const matchDistance = Math.floor(Math.max(len1, len2) / 2) - 1;
+  const matchDistance = Math.floor(Math.min(len1, len2) / 2) - 1;
 
   if (matchDistance < 0) matchDistance = 0;

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:117:36
   // Compute Jaro similarity first
   const len1 = a.length;
   const len2 = b.length;
-  const matchDistance = Math.floor(Math.max(len1, len2) / 2) - 1;
+  const matchDistance = Math.floor(Math.max(len1, len2) * 2) - 1;
 
   if (matchDistance < 0) matchDistance = 0;

[Survived] ConditionalExpression
services/utils/scoringUtils.js:119:7
   const len2 = b.length;
   const matchDistance = Math.floor(Math.max(len1, len2) / 2) - 1;
 
-  if (matchDistance < 0) matchDistance = 0;
+  if (true) matchDistance = 0;
 
   const aMatched = new Array(len1).fill(false);

[Survived] EqualityOperator
services/utils/scoringUtils.js:119:7
   const len2 = b.length;
   const matchDistance = Math.floor(Math.max(len1, len2) / 2) - 1;
 
-  if (matchDistance < 0) matchDistance = 0;
+  if (matchDistance <= 0) matchDistance = 0;
 
   const aMatched = new Array(len1).fill(false);

[Survived] BooleanLiteral
services/utils/scoringUtils.js:121:41
 
   if (matchDistance < 0) matchDistance = 0;
 
-  const aMatched = new Array(len1).fill(false);
+  const aMatched = new Array(len1).fill(true);
   const bMatched = new Array(len2).fill(false);
 

[Survived] BooleanLiteral
services/utils/scoringUtils.js:122:41
   if (matchDistance < 0) matchDistance = 0;
 
   const aMatched = new Array(len1).fill(false);
-  const bMatched = new Array(len2).fill(false);
+  const bMatched = new Array(len2).fill(true);
 
   let matches = 0;

[Survived] UpdateOperator
services/utils/scoringUtils.js:128:29
   let transpositions = 0;
 
   // Find matches
-  for (let i = 0; i < len1; i++) {
+  for (let i = 0; i < len1; i--) {
     const start = Math.max(0, i - matchDistance);
     const end = Math.min(i + matchDistance + 1, len2);

[Survived] EqualityOperator
services/utils/scoringUtils.js:128:19
   let transpositions = 0;
 
   // Find matches
-  for (let i = 0; i < len1; i++) {
+  for (let i = 0; i >= len1; i++) {
     const start = Math.max(0, i - matchDistance);
     const end = Math.min(i + matchDistance + 1, len2);

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:129:31
 
   // Find matches
   for (let i = 0; i < len1; i++) {
-    const start = Math.max(0, i - matchDistance);
+    const start = Math.max(0, i + matchDistance);
     const end = Math.min(i + matchDistance + 1, len2);
 

[Survived] MethodExpression
services/utils/scoringUtils.js:129:19
 
   // Find matches
   for (let i = 0; i < len1; i++) {
-    const start = Math.max(0, i - matchDistance);
+    const start = Math.min(0, i - matchDistance);
     const end = Math.min(i + matchDistance + 1, len2);
 

[Survived] MethodExpression
services/utils/scoringUtils.js:130:17
   // Find matches
   for (let i = 0; i < len1; i++) {
     const start = Math.max(0, i - matchDistance);
-    const end = Math.min(i + matchDistance + 1, len2);
+    const end = Math.max(i + matchDistance + 1, len2);
 
     for (let j = start; j < end; j++) {

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:130:26
   // Find matches
   for (let i = 0; i < len1; i++) {
     const start = Math.max(0, i - matchDistance);
-    const end = Math.min(i + matchDistance + 1, len2);
+    const end = Math.min(i - matchDistance + 1, len2);
 
     for (let j = start; j < end; j++) {

[Survived] EqualityOperator
services/utils/scoringUtils.js:132:25
     const start = Math.max(0, i - matchDistance);
     const end = Math.min(i + matchDistance + 1, len2);
 
-    for (let j = start; j < end; j++) {
+    for (let j = start; j <= end; j++) {
       if (bMatched[j] || a[i] !== b[j]) continue;
       aMatched[i] = true;

[Survived] ConditionalExpression
services/utils/scoringUtils.js:132:25
     const start = Math.max(0, i - matchDistance);
     const end = Math.min(i + matchDistance + 1, len2);
 
-    for (let j = start; j < end; j++) {
+    for (let j = start; false; j++) {
       if (bMatched[j] || a[i] !== b[j]) continue;
       aMatched[i] = true;

[Survived] ConditionalExpression
services/utils/scoringUtils.js:133:11
     const end = Math.min(i + matchDistance + 1, len2);
 
     for (let j = start; j < end; j++) {
-      if (bMatched[j] || a[i] !== b[j]) continue;
+      if (true) continue;
       aMatched[i] = true;
       bMatched[j] = true;

[Survived] LogicalOperator
services/utils/scoringUtils.js:133:11
     const end = Math.min(i + matchDistance + 1, len2);
 
     for (let j = start; j < end; j++) {
-      if (bMatched[j] || a[i] !== b[j]) continue;
+      if (bMatched[j] && a[i] !== b[j]) continue;
       aMatched[i] = true;
       bMatched[j] = true;

[Survived] BooleanLiteral
services/utils/scoringUtils.js:134:21
 
     for (let j = start; j < end; j++) {
       if (bMatched[j] || a[i] !== b[j]) continue;
-      aMatched[i] = true;
+      aMatched[i] = false;
       bMatched[j] = true;
       matches++;

[Survived] BooleanLiteral
services/utils/scoringUtils.js:135:21
     for (let j = start; j < end; j++) {
       if (bMatched[j] || a[i] !== b[j]) continue;
       aMatched[i] = true;
-      bMatched[j] = true;
+      bMatched[j] = false;
       matches++;
       break;

[Survived] UpdateOperator
services/utils/scoringUtils.js:136:7
       if (bMatched[j] || a[i] !== b[j]) continue;
       aMatched[i] = true;
       bMatched[j] = true;
-      matches++;
+      matches--;
       break;
     }

[Survived] ConditionalExpression
services/utils/scoringUtils.js:141:7
     }
   }
 
-  if (matches === 0) return 0;
+  if (true) return 0;
 
   // Count transpositions

[Survived] ConditionalExpression
services/utils/scoringUtils.js:141:7
     }
   }
 
-  if (matches === 0) return 0;
+  if (false) return 0;
 
   // Count transpositions

[Survived] UpdateOperator
services/utils/scoringUtils.js:145:29
 
   // Count transpositions
   let k = 0;
-  for (let i = 0; i < len1; i++) {
+  for (let i = 0; i < len1; i--) {
     if (!aMatched[i]) continue;
     while (!bMatched[k]) k++;

[Survived] BlockStatement
services/utils/scoringUtils.js:145:34
 
   // Count transpositions
   let k = 0;
-  for (let i = 0; i < len1; i++) {
-    if (!aMatched[i]) continue;
-    while (!bMatched[k]) k++;
-    if (a[i] !== b[k]) transpositions++;
-    k++;
-  }
+  for (let i = 0; i < len1; i++) {}
 
   const jaro = (matches / len1 + matches / len2 + (matches - transpositions / 2) / matches) / 3;

[Survived] ConditionalExpression
services/utils/scoringUtils.js:146:9
   // Count transpositions
   let k = 0;
   for (let i = 0; i < len1; i++) {
-    if (!aMatched[i]) continue;
+    if (false) continue;
     while (!bMatched[k]) k++;
     if (a[i] !== b[k]) transpositions++;

[Survived] BooleanLiteral
services/utils/scoringUtils.js:146:9
   // Count transpositions
   let k = 0;
   for (let i = 0; i < len1; i++) {
-    if (!aMatched[i]) continue;
+    if (aMatched[i]) continue;
     while (!bMatched[k]) k++;
     if (a[i] !== b[k]) transpositions++;

[Survived] BooleanLiteral
services/utils/scoringUtils.js:147:12
   let k = 0;
   for (let i = 0; i < len1; i++) {
     if (!aMatched[i]) continue;
-    while (!bMatched[k]) k++;
+    while (bMatched[k]) k++;
     if (a[i] !== b[k]) transpositions++;
     k++;

[Survived] ConditionalExpression
services/utils/scoringUtils.js:147:12
   let k = 0;
   for (let i = 0; i < len1; i++) {
     if (!aMatched[i]) continue;
-    while (!bMatched[k]) k++;
+    while (false) k++;
     if (a[i] !== b[k]) transpositions++;
     k++;

[Survived] UpdateOperator
services/utils/scoringUtils.js:148:24
   for (let i = 0; i < len1; i++) {
     if (!aMatched[i]) continue;
     while (!bMatched[k]) k++;
-    if (a[i] !== b[k]) transpositions++;
+    if (a[i] !== b[k]) transpositions--;
     k++;
   }

[Survived] ConditionalExpression
services/utils/scoringUtils.js:148:9
   for (let i = 0; i < len1; i++) {
     if (!aMatched[i]) continue;
     while (!bMatched[k]) k++;
-    if (a[i] !== b[k]) transpositions++;
+    if (false) transpositions++;
     k++;
   }

[Survived] UpdateOperator
services/utils/scoringUtils.js:149:5
     if (!aMatched[i]) continue;
     while (!bMatched[k]) k++;
     if (a[i] !== b[k]) transpositions++;
-    k++;
+    k--;
   }
 

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:152:16
     k++;
   }
 
-  const jaro = (matches / len1 + matches / len2 + (matches - transpositions / 2) / matches) / 3;
+  const jaro = (matches / len1 + matches / len2 + (matches - transpositions / 2) / matches) * 3;
 
   // Apply Winkler modification: add bonus for matching prefix

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:152:34
     k++;
   }
 
-  const jaro = (matches / len1 + matches / len2 + (matches - transpositions / 2) / matches) / 3;
+  const jaro = (matches / len1 + matches * len2 + (matches - transpositions / 2) / matches) / 3;
 
   // Apply Winkler modification: add bonus for matching prefix

[Survived] UpdateOperator
services/utils/scoringUtils.js:156:48
 
   // Apply Winkler modification: add bonus for matching prefix
   let prefixLen = 0;
-  for (let i = 0; i < Math.min(4, len1, len2); i++) {
+  for (let i = 0; i < Math.min(4, len1, len2); i--) {
     if (a[i] === b[i]) prefixLen++;
     else break;

[Survived] MethodExpression
services/utils/scoringUtils.js:156:23
 
   // Apply Winkler modification: add bonus for matching prefix
   let prefixLen = 0;
-  for (let i = 0; i < Math.min(4, len1, len2); i++) {
+  for (let i = 0; i < Math.max(4, len1, len2); i++) {
     if (a[i] === b[i]) prefixLen++;
     else break;

[Survived] EqualityOperator
services/utils/scoringUtils.js:157:9
   // Apply Winkler modification: add bonus for matching prefix
   let prefixLen = 0;
   for (let i = 0; i < Math.min(4, len1, len2); i++) {
-    if (a[i] === b[i]) prefixLen++;
+    if (a[i] !== b[i]) prefixLen++;
     else break;
   }

[Survived] UpdateOperator
services/utils/scoringUtils.js:157:24
   // Apply Winkler modification: add bonus for matching prefix
   let prefixLen = 0;
   for (let i = 0; i < Math.min(4, len1, len2); i++) {
-    if (a[i] === b[i]) prefixLen++;
+    if (a[i] === b[i]) prefixLen--;
     else break;
   }

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:161:21
     else break;
   }
 
-  const jw = jaro + prefixLen * 0.1 * (1 - jaro);
+  const jw = jaro + prefixLen * 0.1 / (1 - jaro);
   return Math.min(1, jw);
 }

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:161:14
     else break;
   }
 
-  const jw = jaro + prefixLen * 0.1 * (1 - jaro);
+  const jw = jaro - prefixLen * 0.1 * (1 - jaro);
   return Math.min(1, jw);
 }

[Survived] MethodExpression
services/utils/scoringUtils.js:162:10
   }
 
   const jw = jaro + prefixLen * 0.1 * (1 - jaro);
-  return Math.min(1, jw);
+  return Math.max(1, jw);
 }
 

[Survived] ConditionalExpression
services/utils/scoringUtils.js:172:7
  * @returns {number} - similarity score 0–1
  */
 export function levenshteinScore(a, b) {
-  if (!a || !b) return 0;
+  if (true) return 0;
 
   a = String(a).toLowerCase();

[Survived] BooleanLiteral
services/utils/scoringUtils.js:172:13
  * @returns {number} - similarity score 0–1
  */
 export function levenshteinScore(a, b) {
-  if (!a || !b) return 0;
+  if (!a || b) return 0;
 
   a = String(a).toLowerCase();

[Survived] MethodExpression
services/utils/scoringUtils.js:181:18
 
   const len1 = a.length;
   const len2 = b.length;
-  const maxLen = Math.max(len1, len2);
+  const maxLen = Math.min(len1, len2);
 
   if (maxLen === 0) return 1;

[Survived] ConditionalExpression
services/utils/scoringUtils.js:183:7
   const len2 = b.length;
   const maxLen = Math.max(len1, len2);
 
-  if (maxLen === 0) return 1;
+  if (true) return 1;
 
   // Compute Levenshtein distance using dynamic programming

[Survived] ConditionalExpression
services/utils/scoringUtils.js:183:7
   const len2 = b.length;
   const maxLen = Math.max(len1, len2);
 
-  if (maxLen === 0) return 1;
+  if (false) return 1;
 
   // Compute Levenshtein distance using dynamic programming

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:186:35
   if (maxLen === 0) return 1;
 
   // Compute Levenshtein distance using dynamic programming
-  const dp = Array.from({ length: len1 + 1 }, (_, i) =>
+  const dp = Array.from({ length: len1 - 1 }, (_, i) =>
     Array.from({ length: len2 + 1 }, (_, j) => (i === 0 ? j : j === 0 ? i : 0))
   );

[Survived] ArrowFunction
services/utils/scoringUtils.js:186:47
   if (maxLen === 0) return 1;
 
   // Compute Levenshtein distance using dynamic programming
-  const dp = Array.from({ length: len1 + 1 }, (_, i) =>
-    Array.from({ length: len2 + 1 }, (_, j) => (i === 0 ? j : j === 0 ? i : 0))
+  const dp = Array.from({ length: len1 + 1 }, () => undefined
   );
 

[Survived] ConditionalExpression
services/utils/scoringUtils.js:187:63
 
   // Compute Levenshtein distance using dynamic programming
   const dp = Array.from({ length: len1 + 1 }, (_, i) =>
-    Array.from({ length: len2 + 1 }, (_, j) => (i === 0 ? j : j === 0 ? i : 0))
+    Array.from({ length: len2 + 1 }, (_, j) => (i === 0 ? j : false ? i : 0))
   );
 

[Survived] EqualityOperator
services/utils/scoringUtils.js:187:63
 
   // Compute Levenshtein distance using dynamic programming
   const dp = Array.from({ length: len1 + 1 }, (_, i) =>
-    Array.from({ length: len2 + 1 }, (_, j) => (i === 0 ? j : j === 0 ? i : 0))
+    Array.from({ length: len2 + 1 }, (_, j) => (i === 0 ? j : j !== 0 ? i : 0))
   );
 

[Survived] EqualityOperator
services/utils/scoringUtils.js:190:19
     Array.from({ length: len2 + 1 }, (_, j) => (i === 0 ? j : j === 0 ? i : 0))
   );
 
-  for (let i = 1; i <= len1; i++) {
+  for (let i = 1; i < len1; i++) {
     for (let j = 1; j <= len2; j++) {
       const cost = a[i - 1] === b[j - 1] ? 0 : 1;

[Survived] UpdateOperator
services/utils/scoringUtils.js:190:30
     Array.from({ length: len2 + 1 }, (_, j) => (i === 0 ? j : j === 0 ? i : 0))
   );
 
-  for (let i = 1; i <= len1; i++) {
+  for (let i = 1; i <= len1; i--) {
     for (let j = 1; j <= len2; j++) {
       const cost = a[i - 1] === b[j - 1] ? 0 : 1;

[Survived] ConditionalExpression
services/utils/scoringUtils.js:191:21
   );
 
   for (let i = 1; i <= len1; i++) {
-    for (let j = 1; j <= len2; j++) {
+    for (let j = 1; false; j++) {
       const cost = a[i - 1] === b[j - 1] ? 0 : 1;
       dp[i][j] = Math.min(

[Survived] UpdateOperator
services/utils/scoringUtils.js:191:32
   );
 
   for (let i = 1; i <= len1; i++) {
-    for (let j = 1; j <= len2; j++) {
+    for (let j = 1; j <= len2; j--) {
       const cost = a[i - 1] === b[j - 1] ? 0 : 1;
       dp[i][j] = Math.min(
