[Survived] ArithmeticOperator
services/utils/scoringUtils.js:192:22
 
   for (let i = 1; i <= len1; i++) {
     for (let j = 1; j <= len2; j++) {
-      const cost = a[i - 1] === b[j - 1] ? 0 : 1;
+      const cost = a[i + 1] === b[j - 1] ? 0 : 1;
       dp[i][j] = Math.min(
         dp[i - 1][j] + 1,      // deletion

[Survived] EqualityOperator
services/utils/scoringUtils.js:192:20
 
   for (let i = 1; i <= len1; i++) {
     for (let j = 1; j <= len2; j++) {
-      const cost = a[i - 1] === b[j - 1] ? 0 : 1;
+      const cost = a[i - 1] !== b[j - 1] ? 0 : 1;
       dp[i][j] = Math.min(
         dp[i - 1][j] + 1,      // deletion

[Survived] MethodExpression
services/utils/scoringUtils.js:193:18
   for (let i = 1; i <= len1; i++) {
     for (let j = 1; j <= len2; j++) {
       const cost = a[i - 1] === b[j - 1] ? 0 : 1;
-      dp[i][j] = Math.min(
-        dp[i - 1][j] + 1,      // deletion
-        dp[i][j - 1] + 1,      // insertion
-        dp[i - 1][j - 1] + cost // substitution
-      );
+      dp[i][j] = Math.max(dp[i - 1][j] + 1,
+// deletion
+dp[i][j - 1] + 1,
+// insertion
+dp[i - 1][j - 1] + cost // substitution
+);
     }
   }

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:194:12
     for (let j = 1; j <= len2; j++) {
       const cost = a[i - 1] === b[j - 1] ? 0 : 1;
       dp[i][j] = Math.min(
-        dp[i - 1][j] + 1,      // deletion
+        dp[i + 1][j] + 1,      // deletion
         dp[i][j - 1] + 1,      // insertion
         dp[i - 1][j - 1] + cost // substitution

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:194:9
     for (let j = 1; j <= len2; j++) {
       const cost = a[i - 1] === b[j - 1] ? 0 : 1;
       dp[i][j] = Math.min(
-        dp[i - 1][j] + 1,      // deletion
+        dp[i - 1][j] - 1,      // deletion
         dp[i][j - 1] + 1,      // insertion
         dp[i - 1][j - 1] + cost // substitution

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:195:9
       const cost = a[i - 1] === b[j - 1] ? 0 : 1;
       dp[i][j] = Math.min(
         dp[i - 1][j] + 1,      // deletion
-        dp[i][j - 1] + 1,      // insertion
+        // deletion
+dp[i][j - 1] - 1,      // insertion
         dp[i - 1][j - 1] + cost // substitution
       );

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:195:15
       const cost = a[i - 1] === b[j - 1] ? 0 : 1;
       dp[i][j] = Math.min(
         dp[i - 1][j] + 1,      // deletion
-        dp[i][j - 1] + 1,      // insertion
+        dp[i][j + 1] + 1,      // insertion
         dp[i - 1][j - 1] + cost // substitution
       );

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:196:12
       dp[i][j] = Math.min(
         dp[i - 1][j] + 1,      // deletion
         dp[i][j - 1] + 1,      // insertion
-        dp[i - 1][j - 1] + cost // substitution
+        dp[i + 1][j - 1] + cost // substitution
       );
     }

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:196:19
       dp[i][j] = Math.min(
         dp[i - 1][j] + 1,      // deletion
         dp[i][j - 1] + 1,      // insertion
-        dp[i - 1][j - 1] + cost // substitution
+        dp[i - 1][j + 1] + cost // substitution
       );
     }

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:202:10
   }
 
   const distance = dp[len1][len2];
-  return 1 - distance / maxLen;
+  return 1 + distance / maxLen;
 }
 

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:202:14
   }
 
   const distance = dp[len1][len2];
-  return 1 - distance / maxLen;
+  return 1 - distance * maxLen;
 }
 

[Survived] BlockStatement
services/utils/scoringUtils.js:214:73
  * @param {number} strictThreshold - threshold above which addresses are considered too similar to suggest changes (default 0.90)
  * @returns {number} - similarity score 0–1
  */
-export function addressSimilarity(addrA, addrB, strictThreshold = 0.90) {
-  // Handle null/undefined
-  if (!addrA || !addrB) return 0;
-
-  const cosine = cosineSimilarity(addrA, addrB);
-  const jw = jaroWinkler(addrA, addrB);
-  const lev = levenshteinScore(addrA, addrB);
-
-  // Weighted combination with emphasis on Jaro-Winkler for address strings
-  return 0.4 * cosine + 0.45 * jw + 0.15 * lev;
-}
+export function addressSimilarity(addrA, addrB, strictThreshold = 0.90) {}
 
 /**

[Survived] ConditionalExpression
services/utils/scoringUtils.js:216:7
  */
 export function addressSimilarity(addrA, addrB, strictThreshold = 0.90) {
   // Handle null/undefined
-  if (!addrA || !addrB) return 0;
+  if (false) return 0;
 
   const cosine = cosineSimilarity(addrA, addrB);

[Survived] BooleanLiteral
services/utils/scoringUtils.js:216:7
  */
 export function addressSimilarity(addrA, addrB, strictThreshold = 0.90) {
   // Handle null/undefined
-  if (!addrA || !addrB) return 0;
+  if (addrA || !addrB) return 0;
 
   const cosine = cosineSimilarity(addrA, addrB);

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:223:10
   const lev = levenshteinScore(addrA, addrB);
 
   // Weighted combination with emphasis on Jaro-Winkler for address strings
-  return 0.4 * cosine + 0.45 * jw + 0.15 * lev;
+  return 0.4 * cosine - 0.45 * jw + 0.15 * lev;
 }
 

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:223:25
   const lev = levenshteinScore(addrA, addrB);
 
   // Weighted combination with emphasis on Jaro-Winkler for address strings
-  return 0.4 * cosine + 0.45 * jw + 0.15 * lev;
+  return 0.4 * cosine + 0.45 / jw + 0.15 * lev;
 }
 

[Survived] BlockStatement
services/utils/scoringUtils.js:233:51
  *                 each is true/false indicating whether source matched
  * @returns {number} - weighted vote score 0–1
  */
-export function sourceWeightedVote(sourceMatches) {
-  if (!sourceMatches || typeof sourceMatches !== 'object') return 0;
-
-  const weights = {
-    npi: 0.95,
-    azure: 0.85,
-    scrape: 0.70,
-    pdf: 0.60
-  };
-
-  let matchedWeight = 0;
-  let totalWeight = 0;
-
-  for (const [source, matched] of Object.entries(sourceMatches)) {
-    const weight = weights[source.toLowerCase()] || 0;
-    totalWeight += weight;
-    if (matched) matchedWeight += weight;
-  }
-
-  if (totalWeight === 0) return 0;
-
-  return matchedWeight / totalWeight;
-}
+export function sourceWeightedVote(sourceMatches) {}
 
 /**

[Survived] ConditionalExpression
services/utils/scoringUtils.js:234:7
  * @returns {number} - weighted vote score 0–1
  */
 export function sourceWeightedVote(sourceMatches) {
-  if (!sourceMatches || typeof sourceMatches !== 'object') return 0;
+  if (false) return 0;
 
   const weights = {

[Survived] ConditionalExpression
services/utils/scoringUtils.js:234:7
  * @returns {number} - weighted vote score 0–1
  */
 export function sourceWeightedVote(sourceMatches) {
-  if (!sourceMatches || typeof sourceMatches !== 'object') return 0;
+  if (true) return 0;
 
   const weights = {

[Survived] BlockStatement
services/utils/scoringUtils.js:246:66
   let matchedWeight = 0;
   let totalWeight = 0;
 
-  for (const [source, matched] of Object.entries(sourceMatches)) {
-    const weight = weights[source.toLowerCase()] || 0;
-    totalWeight += weight;
-    if (matched) matchedWeight += weight;
-  }
+  for (const [source, matched] of Object.entries(sourceMatches)) {}
 
   if (totalWeight === 0) return 0;

[Survived] ConditionalExpression
services/utils/scoringUtils.js:247:20
   let totalWeight = 0;
 
   for (const [source, matched] of Object.entries(sourceMatches)) {
-    const weight = weights[source.toLowerCase()] || 0;
+    const weight = true;
     totalWeight += weight;
     if (matched) matchedWeight += weight;

[Survived] LogicalOperator
services/utils/scoringUtils.js:247:20
   let totalWeight = 0;
 
   for (const [source, matched] of Object.entries(sourceMatches)) {
-    const weight = weights[source.toLowerCase()] || 0;
+    const weight = weights[source.toLowerCase()] && 0;
     totalWeight += weight;
     if (matched) matchedWeight += weight;

[Survived] AssignmentOperator
services/utils/scoringUtils.js:248:5
 
   for (const [source, matched] of Object.entries(sourceMatches)) {
     const weight = weights[source.toLowerCase()] || 0;
-    totalWeight += weight;
+    totalWeight -= weight;
     if (matched) matchedWeight += weight;
   }

[Survived] ConditionalExpression
services/utils/scoringUtils.js:249:9
   for (const [source, matched] of Object.entries(sourceMatches)) {
     const weight = weights[source.toLowerCase()] || 0;
     totalWeight += weight;
-    if (matched) matchedWeight += weight;
+    if (true) matchedWeight += weight;
   }
 

[Survived] AssignmentOperator
services/utils/scoringUtils.js:249:18
   for (const [source, matched] of Object.entries(sourceMatches)) {
     const weight = weights[source.toLowerCase()] || 0;
     totalWeight += weight;
-    if (matched) matchedWeight += weight;
+    if (matched) matchedWeight -= weight;
   }
 

[Survived] EqualityOperator
services/utils/scoringUtils.js:252:7
     if (matched) matchedWeight += weight;
   }
 
-  if (totalWeight === 0) return 0;
+  if (totalWeight !== 0) return 0;
 
   return matchedWeight / totalWeight;

[Survived] ConditionalExpression
services/utils/scoringUtils.js:252:7
     if (matched) matchedWeight += weight;
   }
 
-  if (totalWeight === 0) return 0;
+  if (false) return 0;
 
   return matchedWeight / totalWeight;

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:254:10
 
   if (totalWeight === 0) return 0;
 
-  return matchedWeight / totalWeight;
+  return matchedWeight * totalWeight;
 }
 

[Survived] ConditionalExpression
services/utils/scoringUtils.js:265:18
  * @returns {number} - final confidence score 0–1
  */
 export function finalScore(scores) {
-  if (!scores || typeof scores !== 'object') return 0;
+  if (!scores || false) return 0;
 
   const { 

[Survived] BooleanLiteral
services/utils/scoringUtils.js:265:7
  * @returns {number} - final confidence score 0–1
  */
 export function finalScore(scores) {
-  if (!scores || typeof scores !== 'object') return 0;
+  if (scores || typeof scores !== 'object') return 0;
 
   const { 

[Survived] BooleanLiteral
services/utils/scoringUtils.js:271:26
     sourceScore = 0, 
     addressScore = 0, 
     phoneScore = 0,
-    hasMultipleSources = false,
+    hasMultipleSources = true,
     hasAuthoritativeSource = false
   } = scores;

[Survived] BooleanLiteral
services/utils/scoringUtils.js:272:30
     addressScore = 0, 
     phoneScore = 0,
     hasMultipleSources = false,
-    hasAuthoritativeSource = false
+    hasAuthoritativeSource = true
   } = scores;
 

[Survived] ObjectLiteral
services/utils/scoringUtils.js:276:19
   } = scores;
 
   // Clamp all scores to 0–1 range
-  const clamped = {
-    sourceScore: Math.max(0, Math.min(1, sourceScore)),
-    addressScore: Math.max(0, Math.min(1, addressScore)),
-    phoneScore: Math.max(0, Math.min(1, phoneScore))
-  };
+  const clamped = {};
 
   // Base weighted score

[Survived] MethodExpression
services/utils/scoringUtils.js:277:30
 
   // Clamp all scores to 0–1 range
   const clamped = {
-    sourceScore: Math.max(0, Math.min(1, sourceScore)),
+    sourceScore: Math.max(0, Math.max(1, sourceScore)),
     addressScore: Math.max(0, Math.min(1, addressScore)),
     phoneScore: Math.max(0, Math.min(1, phoneScore))

[Survived] MethodExpression
services/utils/scoringUtils.js:277:18
 
   // Clamp all scores to 0–1 range
   const clamped = {
-    sourceScore: Math.max(0, Math.min(1, sourceScore)),
+    sourceScore: Math.min(0, Math.min(1, sourceScore)),
     addressScore: Math.max(0, Math.min(1, addressScore)),
     phoneScore: Math.max(0, Math.min(1, phoneScore))

[Survived] MethodExpression
services/utils/scoringUtils.js:278:31
   // Clamp all scores to 0–1 range
   const clamped = {
     sourceScore: Math.max(0, Math.min(1, sourceScore)),
-    addressScore: Math.max(0, Math.min(1, addressScore)),
+    addressScore: Math.max(0, Math.max(1, addressScore)),
     phoneScore: Math.max(0, Math.min(1, phoneScore))
   };

[Survived] MethodExpression
services/utils/scoringUtils.js:278:19
   // Clamp all scores to 0–1 range
   const clamped = {
     sourceScore: Math.max(0, Math.min(1, sourceScore)),
-    addressScore: Math.max(0, Math.min(1, addressScore)),
+    addressScore: Math.min(0, Math.min(1, addressScore)),
     phoneScore: Math.max(0, Math.min(1, phoneScore))
   };

[Survived] MethodExpression
services/utils/scoringUtils.js:279:17
   const clamped = {
     sourceScore: Math.max(0, Math.min(1, sourceScore)),
     addressScore: Math.max(0, Math.min(1, addressScore)),
-    phoneScore: Math.max(0, Math.min(1, phoneScore))
+    phoneScore: Math.min(0, Math.min(1, phoneScore))
   };
 

[Survived] MethodExpression
services/utils/scoringUtils.js:279:29
   const clamped = {
     sourceScore: Math.max(0, Math.min(1, sourceScore)),
     addressScore: Math.max(0, Math.min(1, addressScore)),
-    phoneScore: Math.max(0, Math.min(1, phoneScore))
+    phoneScore: Math.max(0, Math.max(1, phoneScore))
   };
 

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:284:5
 
   // Base weighted score
   let finalConfidence = (
-    0.5 * clamped.sourceScore +
-    0.3 * clamped.addressScore +
+    0.5 * clamped.sourceScore - 0.3 * clamped.addressScore +
     0.2 * clamped.phoneScore
   );

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:284:5
 
   // Base weighted score
   let finalConfidence = (
-    0.5 * clamped.sourceScore +
-    0.3 * clamped.addressScore +
-    0.2 * clamped.phoneScore
+    0.5 * clamped.sourceScore + 0.3 * clamped.addressScore - 0.2 * clamped.phoneScore
   );
 

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:285:5
   // Base weighted score
   let finalConfidence = (
     0.5 * clamped.sourceScore +
-    0.3 * clamped.addressScore +
+    0.3 / clamped.addressScore +
     0.2 * clamped.phoneScore
   );

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:286:5
   let finalConfidence = (
     0.5 * clamped.sourceScore +
     0.3 * clamped.addressScore +
-    0.2 * clamped.phoneScore
+    0.2 / clamped.phoneScore
   );
 

[Survived] BlockStatement
services/utils/scoringUtils.js:290:31
   );
 
   // Ensure authoritative sources are not diluted by unrelated signals
-  if (hasAuthoritativeSource) {
-    finalConfidence = Math.max(finalConfidence, clamped.sourceScore);
-  }
+  if (hasAuthoritativeSource) {}
 
   // Boost confidence for authoritative sources (NPI, official certifications)

[Survived] ConditionalExpression
services/utils/scoringUtils.js:290:7
   );
 
   // Ensure authoritative sources are not diluted by unrelated signals
-  if (hasAuthoritativeSource) {
+  if (false) {
     finalConfidence = Math.max(finalConfidence, clamped.sourceScore);
   }

[Survived] MethodExpression
services/utils/scoringUtils.js:291:23
 
   // Ensure authoritative sources are not diluted by unrelated signals
   if (hasAuthoritativeSource) {
-    finalConfidence = Math.max(finalConfidence, clamped.sourceScore);
+    finalConfidence = Math.min(finalConfidence, clamped.sourceScore);
   }
 

[Survived] ConditionalExpression
services/utils/scoringUtils.js:295:7
   }
 
   // Boost confidence for authoritative sources (NPI, official certifications)
-  if (hasAuthoritativeSource) {
+  if (false) {
     finalConfidence = Math.min(1, finalConfidence * 1.3); // 30% boost
   }

[Survived] ConditionalExpression
services/utils/scoringUtils.js:295:7
   }
 
   // Boost confidence for authoritative sources (NPI, official certifications)
-  if (hasAuthoritativeSource) {
+  if (true) {
     finalConfidence = Math.min(1, finalConfidence * 1.3); // 30% boost
   }

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:296:35
 
   // Boost confidence for authoritative sources (NPI, official certifications)
   if (hasAuthoritativeSource) {
-    finalConfidence = Math.min(1, finalConfidence * 1.3); // 30% boost
+    finalConfidence = Math.min(1, finalConfidence / 1.3); // 30% boost
   }
 

[Survived] MethodExpression
services/utils/scoringUtils.js:296:23
 
   // Boost confidence for authoritative sources (NPI, official certifications)
   if (hasAuthoritativeSource) {
-    finalConfidence = Math.min(1, finalConfidence * 1.3); // 30% boost
+    finalConfidence = Math.max(1, finalConfidence * 1.3); // 30% boost
   }
 

[Survived] ConditionalExpression
services/utils/scoringUtils.js:300:7
   }
 
   // Boost confidence when multiple sources agree
-  if (hasMultipleSources) {
+  if (true) {
     finalConfidence = Math.min(1, finalConfidence * 1.15); // 15% boost
   }

[Survived] ConditionalExpression
services/utils/scoringUtils.js:300:7
   }
 
   // Boost confidence when multiple sources agree
-  if (hasMultipleSources) {
+  if (false) {
     finalConfidence = Math.min(1, finalConfidence * 1.15); // 15% boost
   }

[Survived] MethodExpression
services/utils/scoringUtils.js:301:23
 
   // Boost confidence when multiple sources agree
   if (hasMultipleSources) {
-    finalConfidence = Math.min(1, finalConfidence * 1.15); // 15% boost
+    finalConfidence = Math.max(1, finalConfidence * 1.15); // 15% boost
   }
 

[Survived] ArithmeticOperator
services/utils/scoringUtils.js:301:35
 
   // Boost confidence when multiple sources agree
   if (hasMultipleSources) {
-    finalConfidence = Math.min(1, finalConfidence * 1.15); // 15% boost
+    finalConfidence = Math.min(1, finalConfidence / 1.15); // 15% boost
   }
 

[Survived] BlockStatement
services/utils/scoringUtils.js:313:63
  * @param {number} threshold - default 0.45 (45%)
  * @returns {string} - "AUTO_ACCEPT" or "NEEDS_REVIEW"
  */
-export function determineAction(confidence, threshold = 0.45) {
-  return confidence >= threshold ? 'AUTO_ACCEPT' : 'NEEDS_REVIEW';
-}
+export function determineAction(confidence, threshold = 0.45) {}
 
 /**

[Survived] ConditionalExpression
services/utils/scoringUtils.js:314:10
  * @returns {string} - "AUTO_ACCEPT" or "NEEDS_REVIEW"
  */
 export function determineAction(confidence, threshold = 0.45) {
-  return confidence >= threshold ? 'AUTO_ACCEPT' : 'NEEDS_REVIEW';
+  return true ? 'AUTO_ACCEPT' : 'NEEDS_REVIEW';
 }
 

[Survived] EqualityOperator
services/utils/scoringUtils.js:314:10
  * @returns {string} - "AUTO_ACCEPT" or "NEEDS_REVIEW"
  */
 export function determineAction(confidence, threshold = 0.45) {
-  return confidence >= threshold ? 'AUTO_ACCEPT' : 'NEEDS_REVIEW';
+  return confidence < threshold ? 'AUTO_ACCEPT' : 'NEEDS_REVIEW';
 }
 

[Survived] BlockStatement
services/utils/scoringUtils.js:323:65
  * @param {number} threshold - default 0.45 (45%)
  * @returns {string} - "HIGH" or "LOW"
  */
-export function determineSeverity(confidence, threshold = 0.45) {
-  return confidence >= threshold ? 'LOW' : 'HIGH';
-}
+export function determineSeverity(confidence, threshold = 0.45) {}
 
 /**

[Survived] EqualityOperator
services/utils/scoringUtils.js:324:10
  * @returns {string} - "HIGH" or "LOW"
  */
 export function determineSeverity(confidence, threshold = 0.45) {
-  return confidence >= threshold ? 'LOW' : 'HIGH';
+  return confidence > threshold ? 'LOW' : 'HIGH';
 }
 

[Survived] ConditionalExpression
services/utils/scoringUtils.js:324:10
  * @returns {string} - "HIGH" or "LOW"
  */
 export function determineSeverity(confidence, threshold = 0.45) {
-  return confidence >= threshold ? 'LOW' : 'HIGH';
+  return true ? 'LOW' : 'HIGH';
 }
 

[Survived] BlockStatement
services/utils/scoringUtils.js:335:106
  * @param {number} similarityThreshold - Above this, addresses are too similar to suggest (default 0.99 for exact matches only)
  * @returns {boolean} - True if suggestion should be made, false if addresses are too similar
  */
-export function shouldSuggestAddressChange(currentAddress, suggestedAddress, similarityThreshold = 0.99) {
-  if (!currentAddress || !suggestedAddress) return true;
-  
-  // If exact match, don't suggest
-  if (currentAddress === suggestedAddress) return false;
-  
-  // Calculate similarity
-  const similarity = addressSimilarity(currentAddress, suggestedAddress);
-  
-  // If too similar (>99%), don't suggest - this only allows exact or near-exact matches
-  // Anything different enough (98.9% or less) should be reviewed
-  if (similarity >= similarityThreshold) return false;
-  
-  return true;
-}
+export function shouldSuggestAddressChange(currentAddress, suggestedAddress, similarityThreshold = 0.99) {}
 

[Survived] BooleanLiteral
services/utils/scoringUtils.js:336:26
  * @returns {boolean} - True if suggestion should be made, false if addresses are too similar
  */
 export function shouldSuggestAddressChange(currentAddress, suggestedAddress, similarityThreshold = 0.99) {
-  if (!currentAddress || !suggestedAddress) return true;
+  if (!currentAddress || suggestedAddress) return true;
   
   // If exact match, don't suggest

[Survived] BooleanLiteral
services/utils/scoringUtils.js:336:52
  * @returns {boolean} - True if suggestion should be made, false if addresses are too similar
  */
 export function shouldSuggestAddressChange(currentAddress, suggestedAddress, similarityThreshold = 0.99) {
-  if (!currentAddress || !suggestedAddress) return true;
+  if (!currentAddress || !suggestedAddress) return false;
   
   // If exact match, don't suggest

[Survived] BooleanLiteral
services/utils/scoringUtils.js:339:51
   if (!currentAddress || !suggestedAddress) return true;
   
   // If exact match, don't suggest
-  if (currentAddress === suggestedAddress) return false;
+  if (currentAddress === suggestedAddress) return true;
   
   // Calculate similarity

[Survived] EqualityOperator
services/utils/scoringUtils.js:339:7
   if (!currentAddress || !suggestedAddress) return true;
   
   // If exact match, don't suggest
-  if (currentAddress === suggestedAddress) return false;
+  if (currentAddress !== suggestedAddress) return false;
   
   // Calculate similarity

[Survived] BooleanLiteral
services/utils/scoringUtils.js:346:49
   
   // If too similar (>99%), don't suggest - this only allows exact or near-exact matches
   // Anything different enough (98.9% or less) should be reviewed
-  if (similarity >= similarityThreshold) return false;
+  if (similarity >= similarityThreshold) return true;
   
   return true;

[Survived] EqualityOperator
services/utils/scoringUtils.js:346:7
   
   // If too similar (>99%), don't suggest - this only allows exact or near-exact matches
   // Anything different enough (98.9% or less) should be reviewed
-  if (similarity >= similarityThreshold) return false;
+  if (similarity > similarityThreshold) return false;
   
   return true;
